tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'
brew 'mas'

# Binaries
brew 'antidote'
brew 'bash'
brew 'cocoapods'
brew 'composer'
brew 'coreutils'
brew 'esptool'
brew 'ffmpeg'
brew 'git'
brew 'httpie'
brew 'nmap'
brew 'node'
brew 'php@8.3'
brew 'pipx'
brew 'pnpm'
brew 'poetry'
brew 'pwgen'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ruff-lsp'
brew 'sherlock'
brew 'vim'
brew 'watchman'
brew 'yt-dlp'
brew 'zsh'

# fzf.vim
brew 'fzf'
brew 'bat'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'perl'
brew 'universal-ctags'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-meslo-for-powerlevel10k'

# Apps
cask '1password'
cask '1password-cli'
cask 'anaconda'
cask 'android-studio'
cask 'darktable'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'ghostty'
cask 'macfuse'
cask 'omnissa-horizon-client'
cask 'postman'
cask 'phpstorm'
cask 'pycharm'
cask 'tableplus'
cask 'vlc'
cask 'webstorm'

# Mac App Store
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
mas "Wireguard", id: 1451685025
