tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'
brew 'mas'

# Binaries
brew 'antidote'
brew 'bash'
brew 'composer'
brew 'coreutils'
brew 'esptool'
brew 'ffmpeg'
brew 'git'
brew 'httpie'
brew 'node'
brew 'php@8.3'
brew 'poetry'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'zsh'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-meslo-for-powerlevel10k'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'iterm2'
cask 'phpstorm'
cask 'pycharm'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-horizon-client'

# Mac App Store
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
