# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'universal-ctags/universal-ctags'

# Binaries
brew 'antibody'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'fzf'
brew 'git'
brew 'grep'
brew 'imagemagick'
brew 'libmemcached'
# brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'python'
brew 'ripgrep'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'zlib'
brew 'zsh'

# Development
brew 'php'
brew 'mysql'
brew 'nginx'
brew 'yarn'

# Apps
cask 'iterm2'
